{
    "prompt_from_system": "You are an assistant for program analysis and modifications. Please provide a step-by-step analysis (the analysis should not include any code snippets). Please write the final output into a JSON file, and be sure to use Markdown syntax to wrap the JSON.",
    "operations": {
        "function_inlining": {
            "single_level_question": "Given the following program, identify a function and optimize it out via function inlining. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given the following program, identify all functions (except main). Please write the identified functions into a json: {'target_list': [a list of functions]}. If no function is identified, just give an empty list.",
                "followup_question":  "Given the following program and the specified function, optimize it out via function inlining. Please write the final program into a json: {'program': the final program}."
            }
        },
        "remove_nested_structure": {
            "single_level_question": "Given the following program, identify a nested structure and optimize it out by removing some layers. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given the following program, identify all nested structures. Please write the identified structures into a json: {'target_list': [a list of functions]}. If no function is identified, just give an empty list.",
                "followup_question":  "Given the following program and the specified structure, try removing some layers of this nested structure. Please write the final program into a json: {'program': the final program}."
            }
        },
        "complex_data_type": {
            "single_level_question": "Given the following program, identify a complex data type (i.e., struct, array), break it into simple data type. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given the following program, identify all variables with complex data type (i.e., struct, array). Please write the identified variables into a json: {'target_list': [a list of variables]}. If no variable is identified, just give an empty list.",
                "followup_question":  "Given the following program and the specified variable, simplify it into variables with primary data type. Please write the final program into a json: {'program': the final program}."
            }
        },
        "intermediate_variable": {
            "single_level_question": "Given the following program, identify an intermediate variable, optimize it out via constant propagation or copy propagation. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given the following program, identify all variables that can be optimized by constant propagation or copy propagation. Please write the identified variables into a json: {'target_list': [a list of variables]}. If no variable is identified, just give an empty list.",
                "followup_question":  "Given the following program and the specified variable, optimize it out by constant propagation or copy propagation. Please write the final program into a json: {'program': the final program}."
            }
        },
        "unused_variable": {
            "single_level_question": "Given the following program, identify an unused variable, optimize it out. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given the following program, identify all variables that are never used. Please write the identified variables into a json: {'target_list': [a list of variables]}. If no variable is identified, just give an empty list.",
                "followup_question":  "Given the following program and the specified variable, eliminate this unused variable. Please write the final program into a json: {'program': the final program}."
            }
        }
    }
}
