{
    "prompt_from_system": "You are an assistant for program analysis and modifications. Please provide a step-by-step analysis (the analysis should not include any code snippets). Please write the final output into a JSON file, and be sure to use Markdown syntax to wrap the JSON.",
    "operations": {
        "typedef": {
            "single_level_question": "Given a program, identify a typedef and substitute every instance of the defined data type with its associated original data type. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given a program, find out all typedef in it. Please write the identified typedef declarations into a json: {'target_list': [a list of data type defined by typedef]}. If no typedef is identified, just give an empty list.",
                "followup_question":  "Given a program and the specified typedef, eliminate it, and substitute every instance of the defined data type with its associated original data type. Please write the final program into a json: {'program': the final program}."
            }
        },
        "constant_propagation": {
            "single_level_question": "Given a program, identify an intermediate variable, optimize it out via constant propagation or copy propagation. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given a program, find out all variables that can be optimized by constant propagation or copy propagation. Please write the identified variables into a json: {'target_list': [a list of variables]}. If no variable is identified, just give an empty list.",
                "followup_question":  "Given a program and the specified variable, optimize it out by constant propagation or copy propagation. Please write the final program into a json: {'program': the final program}."
            }
        },
        "function_inlining": {
            "single_level_question": "Given a program, identify a function and optimize it out via function inlining. Please write the final program into a json: {'program': the final program}.",
            "multi_level_question": {
                "primary_question": "Given a program, find out all functions (except main). Please write the identified functions into a json: {'target_list': [a list of functions]}. If no function is identified, just give an empty list.",
                "followup_question":  "Given a program and the specified function, optimize it out via function inlining. Please write the final program into a json: {'program': the final program}."
            }
        }
    }
}
